import {ADD_LIST,REDUCE_LIST} from '../actionType'

export default function homelistReducer(state = {
  menus: [
    {title: '停车缴费管理', menus: ['缴费订单', '结算商户设置']},
    {title: '停前端显示配置', menus: ['Banner配置', '公告管理']},
    {title: '商户管理', menus: ['客户绑定信息审核', '客户信息管理']},
    {title: '物业单据管理', menus: ['保修单', '投诉建议单', '物业缴费订单', '注册数据统计', '绑定数据统计']},
    {title: '物业基础信息管理', menus: ['公司信息维护', '项目信息维护', '小区信息维护', '初始数据配置', '单元信息维护', '收房信息管理', '车位管理']},
    {title: '全域生活方式', menus: ['活动管理', '订单管理', '退款单管理', '城市站点管理']},
    {title: '营销活动管理', menus: ['推广拉新', '金像奖']},
    {title: '会员信息管理', menus: ['会员列表', '身份认证审核']},
    {title: '积分管理', menus: ['积分任务配置', '消费返积分配置', '积分清单', '积分成本核算']},
    {title: '优惠券管理', menus: ['优惠券列表', '优惠券礼包列表']},
    {title: '用户管理', menus: ['用户管理', '资源管理', '角色管理', '授权管理']},
    {title: '系统配置', menus: ['系统参数维护', '短信模版']},
  ],
  tableDta: [
    {data: ['成都合达联行合达物业服务有限公司', '花语岸项目', '9-1-5-502', '李享', '15886432554', '待处理', '2019-03-08 10:33:23']},
    {data: ['贵阳和沐物业股份有限公司', '置信•国际社区', '9-1-5-502', '李享', '15886432554', '待处理', '2019-03-08 10:33:23']},
    {data: ['成都合达联行物业服务有限公司巴中分公司', '645项目', '15-2-2-4', '李可可', '15886432554', '待处理', '2019-03-08 10:33:23']},
    {data: ['成都合达联行物业服务有限公司巴中分公司', '逸景苑', '15-2-2-4', '李享', '15886432554', '待处理', '2019-03-08 10:33:23']},
    {data: ['成都合智商务服务有限公司彭州分公司', '置信•国际社区', '11-2-2-202', '李可可', '15886432554', '待处理', '2019-03-08 10:33:23']},
    {data: ['成都合达联行合达物业服务有限公司', '麓湖宫', '16-1-4-2', '李享', '15886432554', '待处理', '2019-03-08 10:33:23']},
    {data: ['成都合智商务服务有限公司彭州分公司', '逸景苑', '16-1-4-2', '李可可', '15886432554', '待处理', '2019-03-08 10:33:23']},
    {data: ['成都合智商务服务有限公司彭州分公司', '逸景苑', '16-1-4-2', '李可可', '15886432554', '待处理', '2019-03-08 10:33:23']},
  ]

}, action) {
  switch (action.type) {
    case ADD_LIST:
      return Object.assign({},state,{tableDta : state.tableDta.concat([action.payload])})
    case REDUCE_LIST:
      state.tableDta.splice(0,1)
      return {...state, tableDta: state.tableDta}
    default:
      return state
  }
}